package Data;
//-o нужно уметь задавать путь для результатов.
//-p задает префикс имен выходных файлов.
//-a можно задать режим добавления в существующие файлы.
//Выбор статистики производится опциями -s и -f соответственно. Краткая статистика содержит только
//количество элементов записанных в исходящие файлы. Полная статистика для чисел
// дополнительно содержит минимальное и максимальное значения, сумма и среднее.
// Полная статистика для строк, помимо

public class Flag {
    public enum flag {

        O("-o",false),
        P("-p",false),
        A("-a",false),
        S("-s",false),
        F("-f",false);



        private  String flag;

        flag(String flag,boolean isTrue){
            this.flag=flag;
            //this.isTrue=isTrue;
        }
        public String getFlag(){
            return flag;
        }
    }
}
